research/thesis.org
#+TITLE: 赵鑫的博士学位论文
#+FILETAGS: :thesis:research:

* DONE [#C] 论文模板 [5/5]			      :thesis:latex:template:
 - [X] 封面再靠上 \usrpackage{layout} \addtowidth
 - [X] ming/mang bbl自动 （放弃） 参考bstutf8.bst
 - [X] pdfpages宏包引用pdf：pdf1.6, 引入失败，只有半个. acrobat->advanced->optimizer
 - [X] 参考文献中文作者出不来，用NL，不用bstutf8
 - [X] 参考文献url字体：\usrpackage{url} \urlstyle{rm}

* DONE [#A] 最后完成论文 [6/6]					     :thesis:
  - State "DONE"       [2010-12-11 六 20:04]
  - [X] ch3 性能分析 [2/2]
    + [X] 存储开销：多层次，密钥链、初始参数
    + [X] 公式化分析；通信开销分析 （放弃）
  - [X] ch3 实验内容 [7/7]
    + [X] 通信模式，指数分布
    + [X] DoS：onekey-authtime	2协议，2通信
    + [X] 密钥资源利用率：keychain-use
    + [X] 密钥产生、密钥认证：计算开销
    + [X] 认证延迟时间:
    + [X] 存储实现；密钥链、报文存储开销	3协议，2通信
    + [X] 报文数、总报文流量
  - [X] 参考文献上标还是大方括号 （放弃）
  - [X] 摘要
  - [X] ch5开始图、第2节标题
  - [X] ch6帽子：模拟需求、不足、工作。标题。
该文件的格式为
  - [X] ch7
  - [X] 所有内容完善 [5/5]
    + [X] ZZZX ch1(3) ch2(2)
    + [X] ch2 图例
    + [X] ch4数据图重新安排
    + [X] tick, 指数分布数据， xlabel 速率/时间
    + [X] 参考文献格式
  - [X] 列表环境的细致化
    + [X] ch6 moteEmu拓扑图, 总体结构
    + [X] 模板中每章最后一页：改变\cleardoublepage定义
    + [X] 定义及其前一段行间距：\theorembodyfont{\linespread{1.6}\rmfamily}

* 文章格式						       :thesis:latex:
格式及宏包、使用环境等问题
** DONE 图htbp选项没有手动安排好
** DONE 颜色、灰度等的进一步确定
** DONE 较好看的item环境：paralist及参数减少行距，用list定制自定义环境
** DONE 封面与word模板统一
** DONE tikz图形
** DONE 表格的字号统一： 自定义环境
** DONE 各章openright，其它openany： 主文档用openany选项，各章开头用清华模板中的cleardoublepage
** DONE makefile
** DONE hyperref参数的进一步细化
** DONE 书签定位不准: 直接用清华模板的thu@chapter
** DONE 书脊： 结合清华模板和raisebox、fbox等命令修改得到

** 关于参考文件
*** bst 文件的说明							:bst:

 1. 英文作者格式是textsc，与学位论文不一致
 2. inproceedings文献很多，格式要求中的publisher和address很难收集。默认这两个域没
    有时用[S.L.] 和[s.n.]代替，改成用空代替。
 3. 教务要求格式：中文文献中用半角标点无空格，英文作者名字缩写加点。

*** 问题
 - 5, 11输出不全

** 关于图形

tikz有理想的特性，但不能胜任所有的图形画图。
为此以inkscape作补充，并尽可能保持统一风格。

图尽其意，并且精美才是目标，不要太过纠缠于用什么工具来画图。按重要性来说：
 1. 图形与内容的完美配合
 2. 构图
 3. 图形的精美和风格
 4. 画图工具，矢量图

对于2、3，多看些书，用书中的构图和风格作参考；多熟悉tikz（看example，了解用法以
及fade, shading, pattern, opacity等修饰使用）。

* 文章内容							     :thesis:
** from supervisor
 - ch1:应用特点图
 - ch3:图：可预测性? 混合报文传输模式
 - ch4:FBAP的应用特点 
 - ch5:SABA框图，整体内容

 - 面临的挑战 :: 开放式的问题
 - 现有工作的不足 :: 本文中应该有对应的解决方法

** 思考收获

 - 宽松同步宽松在哪？  安全条件 delta
 - 安全条件计算的时间点    按标记计算
 - K_0不可篡改、伪造；保密性
** 参考内容
