html/research/thesis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>赵鑫的博士学位论文</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="赵鑫的博士学位论文"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-31T16:13+0800"/>
<meta name="author" content="ZHAO Xin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/default.css"/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">赵鑫的博士学位论文</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">论文模板 [5/5]</a></li>
<li><a href="#sec-2">最后完成论文 [6/6]</a></li>
<li><a href="#sec-3">文章格式</a>
<ul>
<li><a href="#sec-3-1">图htbp选项没有手动安排好</a></li>
<li><a href="#sec-3-2">颜色、灰度等的进一步确定</a></li>
<li><a href="#sec-3-3">较好看的item环境：paralist及参数减少行距，用list定制自定义环境</a></li>
<li><a href="#sec-3-4">封面与word模板统一</a></li>
<li><a href="#sec-3-5">tikz图形</a></li>
<li><a href="#sec-3-6">表格的字号统一： 自定义环境</a></li>
<li><a href="#sec-3-7">各章openright，其它openany： 主文档用openany选项，各章开头用清华模板中的cleardoublepage</a></li>
<li><a href="#sec-3-8">makefile</a></li>
<li><a href="#sec-3-9">hyperref参数的进一步细化</a></li>
<li><a href="#sec-3-10">书签定位不准: 直接用清华模板的thu@chapter</a></li>
<li><a href="#sec-3-11">书脊： 结合清华模板和raisebox、fbox等命令修改得到</a></li>
<li><a href="#sec-3-12">关于参考文件</a>
<ul>
<li><a href="#sec-3-12-1">bst 文件的说明</a></li>
<li><a href="#sec-3-12-2">问题</a></li>
</ul>
</li>
<li><a href="#sec-3-13">关于图形</a></li>
</ul>
</li>
<li><a href="#sec-4">文章内容</a>
<ul>
<li><a href="#sec-4-1">from supervisor</a></li>
<li><a href="#sec-4-2">思考收获</a></li>
<li><a href="#sec-4-3">参考内容</a>
<ul>
<li><a href="#sec-4-3-1">green power</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">latex, tinyos 环境及实验评测</a>
<ul>
<li><a href="#sec-5-1">TinyOS install on Ubuntu Hardy</a></li>
<li><a href="#sec-5-2">GBAM</a></li>
<li><a href="#sec-5-3">实验：</a></li>
</ul>
</li>
<li><a href="#sec-6">编辑器</a>
<ul>
<li><a href="#sec-6-1">emacs point to region</a></li>
</ul>
</li>
<li><a href="#sec-7">答辩ppt的beamer心得</a>
<ul>
<li>
<ul>
<li><a href="#sec-7-1">动画和视频</a></li>
<li><a href="#sec-7-2">图形技巧</a></li>
<li><a href="#sec-7-3">overlay效果</a></li>
<li><a href="#sec-7-4">其它</a></li>
</ul>
</li>
<li><a href="#sec-7-1">论文答辩相关 [1/1]</a></li>
</ul>
</li>
<li><a href="#sec-8">答辩后完成 [11/11]</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="done DONE">DONE</span> 论文模板 [5/5] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span>&nbsp;<span class="latex">latex</span>&nbsp;<span class="template">template</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><code>[X]</code> 封面再靠上 \usrpackage{layout} \addtowidth
</li>
<li><code>[X]</code> ming/mang bbl自动 （放弃） 参考bstutf8.bst
</li>
<li><code>[X]</code> pdfpages宏包引用pdf：pdf1.6, 引入失败，只有半个. acrobat-&gt;advanced-&gt;optimizer
</li>
<li><code>[X]</code> 参考文献中文作者出不来，用NL，不用bstutf8
</li>
<li><code>[X]</code> 参考文献url字体：\usrpackage{url} \urlstyle{rm}
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="done DONE">DONE</span> 最后完成论文 [6/6] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>State "DONE" <span class="timestamp-wrapper"> <span class="timestamp">2010-12-11 六 20:04</span></span>
</li>
<li><code>[X]</code> ch3 性能分析 [2/2]
<ul>
<li><code>[X]</code> 存储开销：多层次，密钥链、初始参数
</li>
<li><code>[X]</code> 公式化分析；通信开销分析 （放弃）
</li>
</ul>

</li>
<li><code>[X]</code> ch3 实验内容 [7/7]
<ul>
<li><code>[X]</code> 通信模式，指数分布
</li>
<li><code>[X]</code> DoS：onekey-authtime  2协议，2通信
</li>
<li><code>[X]</code> 密钥资源利用率：keychain-use
</li>
<li><code>[X]</code> 密钥产生、密钥认证：计算开销
</li>
<li><code>[X]</code> 认证延迟时间:
</li>
<li><code>[X]</code> 存储实现；密钥链、报文存储开销    3协议，2通信
</li>
<li><code>[X]</code> 报文数、总报文流量
</li>
</ul>

</li>
<li><code>[X]</code> 参考文献上标还是大方括号 （放弃）
</li>
<li><code>[X]</code> 摘要
</li>
<li><code>[X]</code> ch5开始图、第2节标题
</li>
<li><code>[X]</code> ch6帽子：模拟需求、不足、工作。标题。
</li>
</ul>

<p>该文件的格式为
</p><ul>
<li><code>[X]</code> ch7
</li>
<li><code>[X]</code> 所有内容完善 [5/5]
<ul>
<li><code>[X]</code> ZZZX ch1(3) ch2(2)
</li>
<li><code>[X]</code> ch2 图例
</li>
<li><code>[X]</code> ch4数据图重新安排
</li>
<li><code>[X]</code> tick, 指数分布数据， xlabel 速率/时间
</li>
<li><code>[X]</code> 参考文献格式
</li>
</ul>

</li>
<li><code>[X]</code> 列表环境的细致化
<ul>
<li><code>[X]</code> ch6 moteEmu拓扑图, 总体结构
</li>
<li><code>[X]</code> 模板中每章最后一页：改变\cleardoublepage定义
</li>
<li><code>[X]</code> 定义及其前一段行间距：\theorembodyfont{\linespread{1.6}\rmfamily}
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">文章格式 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span>&nbsp;<span class="latex">latex</span></span></h2>
<div class="outline-text-2" id="text-3">

<p>格式及宏包、使用环境等问题
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="done DONE">DONE</span> 图htbp选项没有手动安排好</h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="done DONE">DONE</span> 颜色、灰度等的进一步确定</h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="done DONE">DONE</span> 较好看的item环境：paralist及参数减少行距，用list定制自定义环境</h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="done DONE">DONE</span> 封面与word模板统一</h3>
<div class="outline-text-3" id="text-3-4">

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="done DONE">DONE</span> tikz图形</h3>
<div class="outline-text-3" id="text-3-5">

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="done DONE">DONE</span> 表格的字号统一： 自定义环境</h3>
<div class="outline-text-3" id="text-3-6">

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="done DONE">DONE</span> 各章openright，其它openany： 主文档用openany选项，各章开头用清华模板中的cleardoublepage</h3>
<div class="outline-text-3" id="text-3-7">

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="done DONE">DONE</span> makefile</h3>
<div class="outline-text-3" id="text-3-8">

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="done DONE">DONE</span> hyperref参数的进一步细化</h3>
<div class="outline-text-3" id="text-3-9">

</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="done DONE">DONE</span> 书签定位不准: 直接用清华模板的thu@chapter</h3>
<div class="outline-text-3" id="text-3-10">

</div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="done DONE">DONE</span> 书脊： 结合清华模板和raisebox、fbox等命令修改得到</h3>
<div class="outline-text-3" id="text-3-11">


</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12">关于参考文件</h3>
<div class="outline-text-3" id="text-3-12">


</div>

<div id="outline-container-3-12-1" class="outline-4">
<h4 id="sec-3-12-1">bst 文件的说明 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bst">bst</span></span></h4>
<div class="outline-text-4" id="text-3-12-1">


<ol>
<li>英文作者格式是textsc，与学位论文不一致
</li>
<li>inproceedings文献很多，格式要求中的publisher和address很难收集。默认这两个域没
    有时用[S.L.] 和[s.n.]代替，改成用空代替。
</li>
<li>教务要求格式：中文文献中用半角标点无空格，英文作者名字缩写加点。
</li>
</ol>


</div>

</div>

<div id="outline-container-3-12-2" class="outline-4">
<h4 id="sec-3-12-2">问题</h4>
<div class="outline-text-4" id="text-3-12-2">

<ul>
<li>5, 11输出不全
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13">关于图形</h3>
<div class="outline-text-3" id="text-3-13">


<p>
tikz有理想的特性，但不能胜任所有的图形画图。
为此以inkscape作补充，并尽可能保持统一风格。
</p>
<p>
图尽其意，并且精美才是目标，不要太过纠缠于用什么工具来画图。按重要性来说：
</p><ol>
<li>图形与内容的完美配合
</li>
<li>构图
</li>
<li>图形的精美和风格
</li>
<li>画图工具，矢量图
</li>
</ol>


<p>
对于2、3，多看些书，用书中的构图和风格作参考；多熟悉tikz（看example，了解用法以
及fade, shading, pattern, opacity等修饰使用）。
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">文章内容 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span></span></h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">from supervisor</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>ch1:应用特点图
</li>
<li>ch3:图：可预测性? 混合报文传输模式
</li>
<li>ch4:FBAP的应用特点 
</li>
<li>ch5:SABA框图，整体内容

</li>
<li>开放式的问题
</li>
<li>本文中应该有对应的解决方法
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">思考收获</h3>
<div class="outline-text-3" id="text-4-2">


<ul>
<li>宽松同步宽松在哪？  安全条件 delta
</li>
<li>安全条件计算的时间点    按标记计算
</li>
<li>K<sub>0不可篡改、伪造；保密性</sub>
</li>
</ul>

</div>

</div>
