research/thesis.org
*** green power							:green_power:

ZigBee联盟为能量收集设备开发Green Power标准
http://www.gkong.com 　2009-7-3 17:05:01　　

ZigBee Alliances developing Green Power standards for energy harvesting devices
ZigBee联盟为能量收集设备开发Green Power标准June 29, 2009 -- The ZigBee(R)
Alliance, a global ecosystem of companies creating wireless solutions for use in
energy management, commercial and consumer applications, today announced
development of the ZigBee Green Power feature set to establish a global,
standard technology for self-powered devices operating through energy harvesting
techniques. These devices will communicate seamlessly with existing ZigBee and
ZigBee PRO networks and will enable maintenance free, environmentally friendly
products that eliminate the need for wires and batteries to power control
devices. 6月29日消息——为能源管理、商业以及消费应用创造无线解决方案的全球性企业联
盟 ZigBee联盟今日宣布开发ZigBee Green Power 功能套件，从而为通过能量收集技术运行
的自供电设备确立一种全球性标准技术。这些设备将与现有的 ZigBee 和 ZigBee PRO 网络
进行无缝的通信，并将使环境友好型的免维护产品成为可能，动力控制设备不再需要电线和
电池。ZigBee Green Power enables new capabilities available to the ZigBee and
ZigBee PRO networks. When the ZigBee Green Power standard is made available to
Alliance members at the end of 2009, only ZigBee will offer an established,
competitive marketplace for deploying switches, sensors and controllers using
harvested energy in residential, commercial and industrial environments. Its
energy harvesting capabilities will give manufacturers greater flexibility when
designing innovative ZigBee products and solutions. Because ZigBee Green Power
will work seamlessly with ZigBee and ZigBee PRO networks, it will enjoy all of
ZigBee's numerous strengths, including: ZigBee Green Power 使新的功能可用于
ZigBee 和ZigBee PRO 网络。等到2009年年底ZigBee Green Power 标准面向联盟会员推出的
时候，将只有ZigBee 利用收集的能源在住宅、商业和工业环境中配置开关、传感器和控制
器，提供一个已经建成且具有竞争力的市场。其能源收集能力将使制造商在设计创新型
ZigBee 产品和解决方案时拥有更大的灵活性。由于ZigBee Green Power 将与ZigBee 和
ZigBee PRO 网络完美无缺协作，所以它将享有 ZigBee 的众多优势，其中包括：

- Physical Radio - Uses popular IEEE 802.15.4 standard radios available from
  numerous suppliers
- 2.4 GHz Band - Offers simple global operation vs. country specific radio
  frequency
- Interference Avoidance - Demonstrated robust performance in noisy radio
  frequency environments
- Robust Mesh Networking - Makes network set-up and maintenance easy, along with
  large coverage areas, and renowned reliability


- Security - Takes full advantage of ZigBee's robust security suite
- Certification - Unbiased, independent certification of ZigBee products
- Open Standard - Strong, cost competitive environment versus single-vendor
  solutions

- 常用的无线电 -- 采用众多供应商都采用的 IEEE 802.15.4 标准无线电
- 2.4 GHz 频段 -- 提供简单的全球性操作，而不是特定国家的无线电频率
- 避免干扰 -- 在有杂音的射频环境下的可靠表现得到证明
- 强大的网状联网能力 -- 使网络安装和维护变容易，并且具有较大覆盖面和突出的可靠性
- 安全 -- 充分利用 ZigBee 可靠的安全套件
- 认证 -- ZigBee 产品无偏见的独立认证
- 开放式标准 -- 强大而又具有成本效益的环境，

而不是单一厂商的解决方案

"This new enhancement of the ZigBee standard demonstrates how such a dynamic
ecosystem can bring innovation to the market", says Frederic Vaillant, vice
president, Technology Innovation at Schneider Electric. "Having energy
harvesting devices connected seamlessly to standard ZigBee networks will provide
our customers with maintenance-free and even more environment-conscious
solutions." 施耐德电气技术创新副总裁 Frederic Vaillant 表示："ZigBee 标准的这种改
进显示了这样一个充满生机的企业联盟如何能为市场带来创新。把能收集能源的装置完美无
缺地连接到标准的 ZigBee 网络，为我们的客户提供免维护、甚至是更有环境意识的解决方
案。" "ZigBee Green Power provides the world with a true standard for control
and sensing products that can utilize harvested energy," said Bob Heile,
chairman of the ZigBee Alliance. "These maintenance-free devices greatly expand
your flexibility when added to comprehensive ZigBee networks already automating
or monitoring businesses, homes and industrial environments." ZigBee 联盟主席
Bob Heile 说道："ZigBee Green Power 针对可以利用收集的能源之控制和传感产品，为全
球带来了真正的标准。这些免维护的设备一旦被添加到已使企业、家庭和工业环境实现自动
化并对其进行监控的广泛 ZigBee 网络中，将大大拓展您的灵活性。" This addition of
ZigBee Green Power to the ZigBee family significantly expands the options
available to manufacturers, and expands the already significant abilities of
ZigBee, further strengthening its leadership position as the global standard for
wirelessly building automation devices into a single, easy to install and use
network. These networks offer superb interference immunity and capabilities to
host thousands of devices. With its ultra low-power requirements, ZigBee devices
today run on regular batteries for years, eliminating the need for wiring to a
power source and offering unparalleled maintenance convenience and installation
flexibility. 这次为 ZigBee 系列增添的 ZigBee Green Power 显著拓展了制造商可用的选
择范围，并且拓展了已经十分重要的 ZigBee 的能力，而 ZigBee 因在易安装、易使用的单
一网络配置无线自动化设备所位居的全球性标准领导地位，从而获得进一步的巩固。这些网
络提供卓越的抗干扰能力和功能性，可以托管数千个设备。ZigBee 设备的功耗要求超低，如
今已可凭借常用的电池运行多年，排除了向电源配线的必要性，并且提供了无与伦比的维护
便利性和安装灵活性。

- ZigBee: Control your world
- ZigBee: 控制您的世界 

ZigBee is the global wireless language connecting dramatically different devices
 to work together and enhance everyday life. The ZigBee Alliance is a non-profit
 association of more than 300 member companies driving development of ZigBee
 wireless technology. The Alliance promotes world-wide adoption of ZigBee as the
 leading wirelessly networked, sensing and control standard for use in consumer
 electronic, energy, home, commercial and industrial areas. ZigBee 是一种全球性无
 线语言，能够将将截然不同的设备连接起来并一起运作，改善日常生活。ZigBee 联盟是一
 个非营利性联盟，拥有300多家正在推动 ZigBee 无线技术发展的会员企业。ZigBee 联盟致
 力于在全球各地推广 ZigBee，促进 ZigBee 成为消费电子、能源、住宅、商业和工业领域
 采用的领先无线联网、传感和控制标准。

--------------------

Date: Monday, June 29, 2009 07:00 GMT ·                   

亚洲网加州圣拉蒙6月29日电 为能源管理 商业以及消费应用创造无线解决方案的全球性企业
联盟 ZigBee(R) 联盟今天宣布开发 ZigBee Green Power 功能套件,从而为通过能量收集技
术运行的自供电设备确立一种全球性标准化的技术 这些设备将与现有的 ZigBee 和 ZigBee
PRO 网络进行完美无缺的通信,并将使环境友好型免维护产品成为可能,而动力控制设备也将
不再需要电线和电池ZigBee Green Power 使新功能可用于 ZigBee 和 ZigBee PRO 网络 等
到2009年年底 ZigBee Green Power 标准面向联盟会员推出时,将只有 ZigBee 利用收集的能
源在住宅 商业和工业环境中提供一个建成且具有竞争力的市场，针对配置开关 传感器和控
制器配置。其能源收集能力将使制造商在设计创新型ZigBee 产品和解决方案时拥有更大的灵
活性 由于 ZigBee Green Power 将与ZigBee 和 ZigBee PRO 网络进行完美无缺的协作,所以
它将享有 ZigBee 的众多优势,其中包括:

- 常用的无线电——采用众多供应商都采用的 IEEE 802.15.4 标准无线电
- 2.4 GHz 频段——提供简单的全球性操作,而不是特定国家的无线电频
率(射频,RF)
- 避免干扰——在有杂音的 RF 环境下的可靠表现得到证明
- 强大的网状联网能力——使网络安装和维护变容易,并且具有较大覆盖面和突出的可靠性
- 安全——充分利用 ZigBee 可靠的安全套件
- 认证——ZigBee 产品无偏见的独立认证——开放式标准——强大而又具有成本效益的环境,而不是单一厂商的解决方案

施耐德电气 (Schneider Electric) 技术创新副总裁弗雷德里克· 瓦利恩特(Frederic
Vaillant) 表示:”ZigBee 标准的这种改进显示了这样一个充满生机的企业联盟如何能为市场
带来创新 把能收集能源的装置完美无缺地连接到标准的 ZigBee 网络,可以为我们的客户提
供免维护 甚至是更有环境意识的解决方案 ” ZigBee 联盟主席鲍勃·海林 （Bob Heile）
说:”ZigBee Green Power 针对可以利用收集的能源之控制和传感产品,为全球带来了真正的
标准 这些免维护的设备一旦被添加到已使企业 家庭和工业环境实现自动化并对其进行监控
的广泛 ZigBee 网络中,将大大拓展您的灵活性 ”这次为 ZigBee 系列增添的 ZigBee Green
Power 效果显著地拓展了制造商可用的选择范围,并且拓展了业已十分重要的 ZigBee 能力,
而 ZigBee 在易安装易使用的单一网络配置无线自动化设备方面居于全球性标准领导地位也
得到了进一步巩固 这些网络提供卓越的抗干扰能力和功能性,可以托管数千个设备ZigBee 设
备的功耗要求超低,如今已可凭借常用的电池运行多年,排除了向电源配线的必要性,并且提供
了无与伦比的维护便利性和安装灵活性ZigBee: 控制您的世界ZigBee 是一种全球性无线语
言,能够将将截然不同的设备连接起来并一起运作,改善日常生活 ZigBee 联盟是一个非营利
性联盟,拥有300多家正在推动ZigBee 无线技术发展的会员企业 ZigBee 联盟致力于在全球各
地推广 ZigBee,促进 ZigBee 成为消费电子 能源 住宅 商业和工业领域采用的领先无线联网
传感和控制标准 垂询详情,请访问:http://www.zigbee.org

消息来源：ZigBee 联盟
联系方式: ZigBee 联盟 Kevin Schader,
电话:+1-925-275-6672,电邮:kschader@inventures.com;
或者 GolinHarris 的 Earlene Tang,电话:+1-714-662-5115,
电邮:etang@golinharris.com（完）

* latex, tinyos 环境及实验评测				      :thesis:tinyos:

