research/thesis.org
** TinyOS install on Ubuntu Hardy				     :tinyos:

星期一, 五月 3, 10:37 上午

All needed:

1. install packages: nesc, jdk, graphviz, cvs, swig, etc
2. cvs download tinyos source
3. make install java, script
4. environment variable setting

Scheme 1:
1. stanford tinyos database

Scheme 2:
1. offline deb & g++-3.4

** GBAM								       :code:

1. seqno 多跳广播时用序列号避免重复广播

2. 接收para_msg的处理: cmt_para保存，不用buffer

3. para_msg 和 gba_msg结构一样

4. curr_key_index=59: state send para与其它msg冲突

5. 58 key verify_msg -> while 循环 条件

** 实验：							 :experiment:

| 分配、发送 | 与muTESLA |
| 初始       | 与m-TESLA |
| 参数选择   | L、dT、Bp |

  M-TESLA

| 初始报文CDM可能丢失。  | 随机发送多个                 |
| CDM可能被篡改。        | 单buffer或多buffer等概率选取 |

* 编辑器
** emacs point to region

 - t: tikzset
 - i: insert
 - m: main includeonly
 - z: this
 - p: cls package


* 答辩ppt的beamer心得						     :beamer:
*** 动画和视频
动画可以用录制的ppt视频，再使用multimedia宏包放出，不知为何不行。

animate宏包可用于制作动画。doc目录下beamer tikz example目录收集了相关的动画演示。
答辩ppt只用到了overlay式的动画，其中下面例子比较有用
 - connecting-text-and-graphics
 - prims-algorithm
 - beamer-arrows

*** 图形技巧

多次使用同一图形，使用\pgfdeclareimage和\pgfuseimage命令。

下面命令用于将图形精确放置在(0,-7cm)到(11cm,1cm)的方框内
\pgfputat{\pgfxy(0,-6.5)}{\pgfbox[left,base]{\pgfimage[width=1cm]{tiger}}}

----

beamer的frame环境中tikz图有时编译有问题，主要是其中用到matrix和tree时。
matrix可用参数ampersand replacement=\&，并用\&作列分割。
tree可用fragile作frame参数解决，或tree中#1参数变为##1或####1.

\path \node可识别overlay参数，便于作逐步展示的动画。

*** overlay效果
基于only的遮盖，放在下面环境中，确保替换内容占有固定的空间。
\begin{overlayarea}{\textwidth}{3cm}
\end{overlayarea}

图形遮盖动画（类似<2->）不像itemize环境那样空间占位是固定的，
而是随新遮盖图的产生动态分配空间，看起来不舒服。
可用\phantom{}将必要图先包含进来占位。

\beamertemplatetransparentcovereddynamic
动态的遮盖效果


*** 其它
 - 图表标题不用caption，而是直接换行写
 - \vspace
 - 单行内容直接写，而不加item
 - 首页、目录页、论文发表情况、致谢可作为模板
 - xetex编译造成没有transition效果，show notes on second screen 效果没试出来


** HANGUP [#C] 论文答辩相关 [1/1]			       :thesis:latex:
    :PROPERTIES:
    :ARCHIVE_TIME: 2011-07-24 日 21:45
    :END:
    - [X] xetex beamer模板
      + notes
xetex notes on second screen
 
That's a reported (and probably not fixed yet) problem in pgfpages. Use this
to tell pgfpages how to set page sizes in XeLaTeX:


\renewcommand\pgfsetupphysicalpagesizes{%
    \pdfpagewidth\pgfphysicalwidth\pdfpageheight\pgfphysicalheight%
}

On Wed, Jun 10, 2009 at 09:31:19PM +0200, Benjamin Koppe wrote:
> now it doesn't work on the first frame, but that's okay. I do a 
> \begin{frame}\end{frame} and afterwards I use Apple's Preview to delete
> the first page.

That would be the hyperref package, it you're using it.
\usepackage[setpagesize=false]{hyperref} helps.
If you're not using hyperref, then it must be something else :-)

      + trans
    - [X] tikz word
加上\pagestyle{empty}部分编译出单独的pdf文件，pdfcrop得到图形pdf文件，
转换成eps文件，openoffice导入eps文件，然后存储成word的doc文档。
    - [X] jabref 空白

在gnome下无显示，或显示不全，且java占 100%CPU，在gnome安全模式下，可正常使用。
2010年 09月 17日 星期五 09:40:15 CST
------
Java程序窗口在Awesome里空白的问题
April 9, 2010

由于要控制虚拟机，不能再在虚拟机里玩STAX了，但是在我ubuntu机器上窗口都是空白的，换用sun-java6-jre
也不行。后来发现在gnome里可以显示，应该是awesome的问题（或是java对其支持的问题），一开始用了
export AWT_TOOLKIT=MToolkit

但是在我的64位系统上死机，查了一些资料后，发现使用
export _JAVA_AWT_WM_NONREPARENTING=”1″

就能解决问题，但是只对openjdk有效。如果你用sun-java6-jre的话就要用’
wmname LG3D

为了避免引起更多问题，我还是把JRE换成openjdk了。总算可以用STAXMon.jar了。
相关链接；
http://brunovernay.blogspot.com/2009/07/java-gui-application-in-awesome-window.html
http://awesome.naquadah.org/wiki/Problems_with_Java#Versions_1.5_And_1.6

来自：
[[http://blog.systemsthoughts.com/2010/04/java-blank-window-awesome-ubuntu-linux.html][Java程序窗口在Awesome里空白的问题 | Systems Thoughts]]
* DONE 答辩后完成 [11/11]					     :thesis:
  - State "DONE"       [2010-12-11 六 20:04]
   - [X] 照片
   - [X] 一卡通延期
   - [X] 答辩材料最终提交 打印单、论文修订
   - [X] 毕业生信息
   - [X] CJE索引搜索
   - [X] 银行卡相关 一卡通销户
   - [X] 托运 找箱子 联系中铁快运
   - [X] copy个人资料到服务器
   - [X] 请客 吉庆 定餐
   - [X] paper to word
   - [X] 手机注销
  :PROPERTIES:
	 :ARCHIVE_TIME: 2010-12-11 六 20:07
  :END:


