html/research/thesis.html

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">TinyOS install on Ubuntu Hardy &nbsp;&nbsp;&nbsp;<span class="tag"><span class="tinyos">tinyos</span></span></h3>
<div class="outline-text-3" id="text-5-1">


<p>
星期一, 五月 3, 10:37 上午
</p>
<p>
All needed:
</p>
<ol>
<li>install packages: nesc, jdk, graphviz, cvs, swig, etc
</li>
<li>cvs download tinyos source
</li>
<li>make install java, script
</li>
<li>environment variable setting
</li>
</ol>


<p>
Scheme 1:
</p><ol>
<li>stanford tinyos database
</li>
</ol>


<p>
Scheme 2:
</p><ol>
<li>offline deb &amp; g++-3.4
</li>
</ol>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">GBAM &nbsp;&nbsp;&nbsp;<span class="tag"><span class="code">code</span></span></h3>
<div class="outline-text-3" id="text-5-2">


<ol>
<li>seqno 多跳广播时用序列号避免重复广播

</li>
<li>接收para<sub>msg的处理</sub>: cmt<sub>para保存，不用buffer</sub>

</li>
<li>para<sub>msg</sub> 和 gba<sub>msg结构一样</sub>

</li>
<li>curr<sub>key</sub><sub>index</sub>=59: state send para与其它msg冲突

</li>
<li>58 key verify<sub>msg</sub> -&gt; while 循环 条件
</li>
</ol>


</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">实验： &nbsp;&nbsp;&nbsp;<span class="tag"><span class="experiment">experiment</span></span></h3>
<div class="outline-text-3" id="text-5-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">分配、发送</td><td class="left">与muTESLA</td></tr>
<tr><td class="left">初始</td><td class="left">与m-TESLA</td></tr>
<tr><td class="left">参数选择</td><td class="left">L、dT、Bp</td></tr>
</tbody>
</table>


<p>
  M-TESLA
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">初始报文CDM可能丢失。</td><td class="left">随机发送多个</td></tr>
<tr><td class="left">CDM可能被篡改。</td><td class="left">单buffer或多buffer等概率选取</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">编辑器</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">emacs point to region</h3>
<div class="outline-text-3" id="text-6-1">


<ul>
<li>t: tikzset
</li>
<li>i: insert
</li>
<li>m: main includeonly
</li>
<li>z: this
</li>
<li>p: cls package
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">答辩ppt的beamer心得 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="beamer">beamer</span></span></h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-4">
<h4 id="sec-7-1">动画和视频</h4>
<div class="outline-text-4" id="text-7-1">

<p>动画可以用录制的ppt视频，再使用multimedia宏包放出，不知为何不行。
</p>
<p>
animate宏包可用于制作动画。doc目录下beamer tikz example目录收集了相关的动画演示。
答辩ppt只用到了overlay式的动画，其中下面例子比较有用
</p><ul>
<li>connecting-text-and-graphics
</li>
<li>prims-algorithm
</li>
<li>beamer-arrows
</li>
</ul>


</div>

</div>

<div id="outline-container-7-2" class="outline-4">
<h4 id="sec-7-2">图形技巧</h4>
<div class="outline-text-4" id="text-7-2">


<p>
多次使用同一图形，使用\pgfdeclareimage和\pgfuseimage命令。
</p>
<p>
下面命令用于将图形精确放置在(0,-7cm)到(11cm,1cm)的方框内
\pgfputat{\pgfxy(0,-6.5)}{\pgfbox[left,base]{\pgfimage[width=1cm]{tiger}}}
</p>
<p>
----
</p>
<p>
beamer的frame环境中tikz图有时编译有问题，主要是其中用到matrix和tree时。
matrix可用参数ampersand replacement=\&amp;，并用\&amp;作列分割。
tree可用fragile作frame参数解决，或tree中#1参数变为##1或####1.
</p>
<p>
\path \node可识别overlay参数，便于作逐步展示的动画。
</p>
</div>

</div>

<div id="outline-container-7-3" class="outline-4">
<h4 id="sec-7-3">overlay效果</h4>
<div class="outline-text-4" id="text-7-3">

<p>基于only的遮盖，放在下面环境中，确保替换内容占有固定的空间。
\begin{overlayarea}{\textwidth}{3cm}
\end{overlayarea}

图形遮盖动画（类似&lt;2-&gt;）不像itemize环境那样空间占位是固定的，
而是随新遮盖图的产生动态分配空间，看起来不舒服。
可用\phantom{}将必要图先包含进来占位。
</p>
<p>
\beamertemplatetransparentcovereddynamic
动态的遮盖效果
</p>

</div>

</div>

<div id="outline-container-7-4" class="outline-4">
<h4 id="sec-7-4">其它</h4>
<div class="outline-text-4" id="text-7-4">

<ul>
<li>图表标题不用caption，而是直接换行写
</li>
<li>\vspace
</li>
<li>单行内容直接写，而不加item
</li>
<li>首页、目录页、论文发表情况、致谢可作为模板
</li>
<li>xetex编译造成没有transition效果，show notes on second screen 效果没试出来
</li>
</ul>



</div>

</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="todo HANGUP">HANGUP</span> 论文答辩相关 [1/1] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span>&nbsp;<span class="latex">latex</span></span></h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li><code>[X]</code> xetex beamer模板
<ul>
<li>notes
</li>
</ul>

</li>
</ul>

<p>xetex notes on second screen
</p>
<p> 
That's a reported (and probably not fixed yet) problem in pgfpages. Use this
to tell pgfpages how to set page sizes in XeLaTeX:
</p>

<p>
\renewcommand\pgfsetupphysicalpagesizes{%
    \pdfpagewidth\pgfphysicalwidth\pdfpageheight\pgfphysicalheight%
}
</p>
<p>
On Wed, Jun 10, 2009 at 09:31:19PM +0200, Benjamin Koppe wrote:
&gt; now it doesn't work on the first frame, but that's okay. I do a 
&gt; \begin{frame}\end{frame} and afterwards I use Apple's Preview to delete
&gt; the first page.
</p>
<p>
That would be the hyperref package, it you're using it.
\usepackage[setpagesize=false]{hyperref} helps.
If you're not using hyperref, then it must be something else :-)
</p>
<ul>
<li>trans
</li>
<li><code>[X]</code> tikz word
</li>
</ul>

<p>加上\pagestyle{empty}部分编译出单独的pdf文件，pdfcrop得到图形pdf文件，
转换成eps文件，openoffice导入eps文件，然后存储成word的doc文档。
</p><ul>
<li><code>[X]</code> jabref 空白
</li>
</ul>


<p>
在gnome下无显示，或显示不全，且java占 100%CPU，在gnome安全模式下，可正常使用。
2010年 09月 17日 星期五 09:40:15 CST

</p>
<hr/>
<p>
Java程序窗口在Awesome里空白的问题
April 9, 2010
</p>
<p>
由于要控制虚拟机，不能再在虚拟机里玩STAX了，但是在我ubuntu机器上窗口都是空白的，换用sun-java6-jre
也不行。后来发现在gnome里可以显示，应该是awesome的问题（或是java对其支持的问题），一开始用了
export AWT<sub>TOOLKIT</sub>=MToolkit
</p>
<p>
但是在我的64位系统上死机，查了一些资料后，发现使用
export <sub>JAVA</sub><sub>AWT</sub><sub>WM</sub><sub>NONREPARENTING</sub>=”1″
</p>
<p>
就能解决问题，但是只对openjdk有效。如果你用sun-java6-jre的话就要用’
wmname LG3D
</p>
<p>
为了避免引起更多问题，我还是把JRE换成openjdk了。总算可以用STAXMon.jar了。
相关链接；
<a href="http://brunovernay.blogspot.com/2009/07/java-gui-application-in-awesome-window.html">http://brunovernay.blogspot.com/2009/07/java-gui-application-in-awesome-window.html</a>
<a href="http://awesome.naquadah.org/wiki/Problems_with_Java#Versions_1.5_And_1.6">http://awesome.naquadah.org/wiki/Problems_with_Java#Versions_1.5_And_1.6</a>
</p>
<p>
来自：
<a href="http://blog.systemsthoughts.com/2010/04/java-blank-window-awesome-ubuntu-linux.html">Java程序窗口在Awesome里空白的问题 | Systems Thoughts</a>
</p></div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="done DONE">DONE</span> 答辩后完成 [11/11] &nbsp;&nbsp;&nbsp;<span class="tag"><span class="thesis">thesis</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>State "DONE" <span class="timestamp-wrapper"> <span class="timestamp">2010-12-11 六 20:04</span></span>
<ul>
<li><code>[X]</code> 照片
</li>
<li><code>[X]</code> 一卡通延期
</li>
<li><code>[X]</code> 答辩材料最终提交 打印单、论文修订
</li>
<li><code>[X]</code> 毕业生信息
</li>
<li><code>[X]</code> CJE索引搜索
</li>
<li><code>[X]</code> 银行卡相关 一卡通销户
</li>
<li><code>[X]</code> 托运 找箱子 联系中铁快运
</li>
<li><code>[X]</code> copy个人资料到服务器
</li>
<li><code>[X]</code> 请客 吉庆 定餐
</li>
<li><code>[X]</code> paper to word
</li>
<li><code>[X]</code> 手机注销
</li>
</ul>

</li>
</ul>



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-31T16:13+0800</p>
<p class="author">Author: ZHAO Xin</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
